# На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
# а некоторые – гербом. Определите минимальное число монеток, 
# которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть.
# Пример:
# 5 -> 1 0 1 1 0

# n = int(input("введите количество монет: "))
# k = 0
# for i in range(n):
#     v = int(input("введите орел = 1 или решка = 0: "))
#     if v == 1:
#         k += 1
# if k<n/2:
#     k
# else:
#     n-k
# print(k)

# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y 
# (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.
# Пример:
# 4 4 -> 2 2
# 5 6 -> 2

# не смог решить

# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# Пример.:
# 10 -> 1 2 4 8
# n=int(input("введите число: "))
# p=1
# while p<=n:
#     print(p,end=';')
#     p=p*2

    
