# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. 
# m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.


# number = int(input("enter: "))

# user_list = []

# for i in range (number):
#     user_list.append(input("enter element 1 string: "))

# user_list1 = list(set(user_list))
# user_list1.sort()

# number2 = int(input("enter: "))

# user_list2 = []

# for i in range (number):
#     user_list2.append(input("enter element 2 string: "))

# user_list3 = list(set(user_list2))
# user_list3.sort()

# print(user_list1)
# print(user_list3)

#  В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только 
# по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — 
# на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле 
# грядки.


# number = int(input("enter: "))
# num_list = []

# for i in range (number):
#     x = int(input("enter: "))
#     num_list.append(num_list)

# sum_list = []
# for j in range (len(num_list)):
#     sum_list.append(num_list[j-1] + num_list[j] + num_list[j+1])

# print(max(sum_list))


